x= int(input("Введите число: "))
print ("Дано число:",x)
print ("Число", x ,"умноженное на 2:", x*2)
print ()

y=input("Введите слово: ")
print ("Дано слово:",y)
print ("Слово", y ,"умноженное на 2:", y*2)
print ()

z=input("Введите строку: ")
print ("Дана строка:", z)
print ("Строка", z ,"умноженная на 2:", z*2)
print ()

b=(input("Введите слово для списка: "))
b=list(b)
print ("Дан список:", b)
print ("Список", b ,"умноженный на 2:", b*2)
print ()

a=input("Введите данные для кортежа: ")
a=tuple(a)
print ("Дан кортеж:",a)
print ("Кортеж", a ,"умноженный на 2:",a*2)

#Мы написали программу, которая производит умножение чисел, слов, строк, списков, кортежей на 2